{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [84, 42], "name": "dense/kernel"}, {"dtype": "float32", "shape": [42], "name": "dense/bias"}, {"dtype": "float32", "shape": [42, 21], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [21], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [21, 7], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [7], "name": "dense_2/bias"}]}], "modelTopology": {"training_config": {"loss": "mae", "loss_weights": null, "metrics": [], "optimizer_config": {"class_name": "Adadelta", "config": {"epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "name": "Adadelta", "rho": 0.949999988079071, "decay": 0.0}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 7, 6, 2], "trainable": true, "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 42, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 21, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "use_bias": true, "activity_regularizer": null}}], "name": "sequential"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.5.2", "format": "layers-model"}